Revit 2024 API
Metal.MetalPattern Property
 The property labeled "Relief Pattern" from the "Metal" schema.
Namespace: Autodesk.Revit.DB.Visual
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2018.1
Syntax
C#
public static string MetalPattern { get; }
Visual Basic
Public Shared ReadOnly Property MetalPattern As String
	Get
Visual C++
public:
static property String^ MetalPattern {
	String^ get ();
}
Remarks
 This property is of type "AssetPropertyInteger" with accepted values in the enumerated type "MetalPatternType".
See Also
Metal Class
Autodesk.Revit.DB.Visual Namespace